# ContextualHelp Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContextualHelp Members
ContextualHelp Class Constructors Methods Properties See Also
---
The ContextualHelp type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ContextualHelp | Constructs a contextual help object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Launch | Launches and displays the help topic specified by the contents of this ContextualHelp object. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HelpPath | The context id, help URL, or help file path. |
| HelpTopicUrl | The help topic URL. |
| HelpType | The contextual help type. |

# See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace